숫자야구게임(숫자 야구 게임)은 플레이어가 컴퓨터가 임의로 선택한 숫자 조합을 추측하는 게임입니다. 

각 추측에 대해 몇 개의 숫자가 자리에 맞게 맞았는지 (스트라이크)와 몇 개의 숫자가 맞지만 자리가 틀린지 (볼)을 알려줍니다.

여기에서는 HTML, CSS, JavaScript를 사용한 간단한 숫자 야구 게임을 만들어보겠습니다.

1. 협업 진행 방식
    [1] 환경 프로그램 : Sourcetree
    [2] 담당 업무
        - main : 박인용
        - html : 고대호
        - CSS : 이예슬
        - JS : 홍세영

2. 프로젝트 진행 과정에서 배운점, 어려웠던 부분
    [1] 배운점
        - 소스트리라는 프로그램으로 협업 진행하는 방법을 알 수 있었습니다.
        - 배웠던 깃 명령어를 배워 이해하고 쓸 수 있었습니다.
    [2] 어려웠던 부분
        - 깃허브와 연동하는 부분에 있어서 연동이 안되는 경우가 있어 삭제 후 다시 작동되는 경우